khoih-prog/BlynkEthernet_STM32_WM/src/Blynk/BlynkDetectDevice.h
/* ESP8266 */
#elif defined(ARDUINO_ESP8266_NODEMCU)
#define BLYNK_INFO_DEVICE  "NodeMCU"
#elif defined(ARDUINO_ARCH_ESP8266)
#define BLYNK_INFO_DEVICE  "ESP8266"

/* ESP32 */
#elif defined(ARDUINO_ARCH_ESP32)
#define BLYNK_INFO_DEVICE  "ESP32"

// KH, Arduino_Core_STM32
/////////////////////////
#elif defined(STM32F0)
  #define BLYNK_INFO_DEVICE  "STM32F0"
  #define BLYNK_NO_YIELD
#elif defined(STM32F1)
  #define BLYNK_INFO_DEVICE  "STM32F1"
  #define BLYNK_NO_YIELD
#elif defined(STM32F2)
  #define BLYNK_INFO_DEVICE  "STM32F2"
  #define BLYNK_NO_YIELD
#elif defined(STM32F3)
  #define BLYNK_INFO_DEVICE  "STM32F3"
  #define BLYNK_NO_YIELD
#elif defined(STM32F4)

  #if defined(ARDUINO_NUCLEO_F429ZI)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F429ZI"
  #elif defined(ARDUINO_NUCLEO_F401RE)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F401RE"
  #elif defined(ARDUINO_NUCLEO_F411RE)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F411RE"
  #elif defined(ARDUINO_NUCLEO_F446RE)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F446RE"
  #elif defined(ARDUINO_DISCO_F407VG)
    #define BLYNK_INFO_DEVICE  "STM32 DISCO_F407VG"   
  #elif defined(ARDUINO_DISCO_F413ZH)
    #define BLYNK_INFO_DEVICE  "STM32 DISCO_F413ZH"  
  #elif defined(ARDUINO_BLACK_F407VE)
    #define BLYNK_INFO_DEVICE  "STM32 BLACK_F407VE"   
  #elif defined(ARDUINO_BLACK_F407VG)
    #define BLYNK_INFO_DEVICE  "STM32 BLACK_F407VG"
  #elif defined(ARDUINO_BLACK_F407ZE)
    #define BLYNK_INFO_DEVICE  "STM32 BLACK_F407ZE"
  #elif defined(ARDUINO_BLACK_F407ZG)
    #define BLYNK_INFO_DEVICE  "STM32 BLACK_F407ZG"
  #elif defined(ARDUINO_BLUE_F407VE_Mini)
    #define BLYNK_INFO_DEVICE  "STM32 BLUE_F407VE_Mini"   
  #elif defined(ARDUINO_DIYMORE_F407VGT)
    #define BLYNK_INFO_DEVICE  "STM32 DIYMORE_F407VGT"  
  #elif defined(ARDUINO_FK407M1)
    #define BLYNK_INFO_DEVICE  "STM32F407VET FK407M1"  
  #elif defined(ARDUINO_BLACKPILL_F401CC)
    #define BLYNK_INFO_DEVICE  "STM32 BLACKPILL_F401CC"
  #elif defined(ARDUINO_BLACKPILL_F411CE)
    #define BLYNK_INFO_DEVICE  "STM32 BLACKPILL_F411CE"
  #elif defined(ARDUINO_CoreBoard_F401RC)
    #define BLYNK_INFO_DEVICE  "STM32 CoreBoard_F401RC"
  #elif defined(ARDUINO_FEATHER_F405)
    #define BLYNK_INFO_DEVICE  "STM32 Adafruit_FEATHER_F405"   
  #elif defined(ARDUINO_THUNDERPACK_F411)
    #define BLYNK_INFO_DEVICE  "STM32 THUNDERPACK_F411"  
  #elif defined(ARDUINO_GENERIC_F446RE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F446RE"
  #elif defined(ARDUINO_GENERIC_F446RC)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F446RC"
  #elif defined(ARDUINO_GENERIC_F423RH)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F423RH"
  #elif defined(ARDUINO_GENERIC_F423CH)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F423CH"
  #elif defined(ARDUINO_GENERIC_F417VG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F417VG"   
  #elif defined(ARDUINO_GENERIC_F417VE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F417VE"  
  #elif defined(ARDUINO_GENERIC_F415RG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F415RG"  
  #elif defined(ARDUINO_GENERIC_F413RH)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F413RH"
  #elif defined(ARDUINO_GENERIC_F413RG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F413RG"
  #elif defined(ARDUINO_GENERIC_F413CH)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F413CH"
  #elif defined(ARDUINO_GENERIC_F413CG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F413CG"   
  #elif defined(ARDUINO_GENERIC_F412RG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F412RG"  
  #elif defined(ARDUINO_GENERIC_F412RE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F412RE"
  #elif defined(ARDUINO_GENERIC_F412CG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F412CG"
  #elif defined(ARDUINO_GENERIC_F412CE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F412CE"
  #elif defined(ARDUINO_GENERIC_F411RE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F411RE"
  #elif defined(ARDUINO_GENERIC_F411RC)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F411RC"   
  #elif defined(ARDUINO_GENERIC_F411CE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F411CE"  
  #elif defined(ARDUINO_GENERIC_F411CC)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F411CC" 
  #elif defined(ARDUINO_GENERIC_F410RB)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F410RB"
  #elif defined(ARDUINO_GENERIC_F410R8)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F410R8"
  #elif defined(ARDUINO_GENERIC_F410CB)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F410CB"
  #elif defined(ARDUINO_GENERIC_F410C8)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F410C8"   
  #elif defined(ARDUINO_GENERIC_F407VG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F407VG"  
  #elif defined(ARDUINO_GENERIC_F407VE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F407VE"
  #elif defined(ARDUINO_GENERIC_F405RG)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F405RG"
  #elif defined(ARDUINO_GENERIC_F401RE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401RE"
  #elif defined(ARDUINO_GENERIC_F401RD)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401RD"
  #elif defined(ARDUINO_GENERIC_F401RC)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401RC"   
  #elif defined(ARDUINO_GENERIC_F401RB)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401RB"  
  #elif defined(ARDUINO_GENERIC_F401CE)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401CE"
  #elif defined(ARDUINO_GENERIC_F401CD)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401CD"
  #elif defined(ARDUINO_GENERIC_F401CC)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401CC"
  #elif defined(ARDUINO_GENERIC_F401CB)
    #define BLYNK_INFO_DEVICE  "STM32 GENERIC_F401CB"  
  #elif defined(ARDUINO_ARMED_V1)
    #define BLYNK_INFO_DEVICE  "STM32 ARMED_V1"   
  #elif defined(ARDUINO_RUMBA32_F446VE)
    #define BLYNK_INFO_DEVICE  "STM32 RUMBA32_F446VE"  
  #elif defined(ARDUINO_ST3DP001_EVAL)
    #define BLYNK_INFO_DEVICE  "STM32 ST3DP001_EVAL"   
  #elif defined(ARDUINO_PRNTR_F407_V1)
    #define BLYNK_INFO_DEVICE  "STM32 PRNTR_F407_V1"   
  #elif defined(ARDUINO_PRNTR_V2)
    #define BLYNK_INFO_DEVICE  "STM32 PRNTR_V2"  
  #elif defined(ARDUINO_VAKE403)
    #define BLYNK_INFO_DEVICE  "STM32 VAKE403"
  #elif defined(ARDUINO_FYSETC_S6)
    #define BLYNK_INFO_DEVICE  "STM32 FYSETC_S6"   
  #elif defined(ARDUINO_PYBSTICK26_LITE)
    #define BLYNK_INFO_DEVICE  "STM32 PYBSTICK26_LITE"  
  #elif defined(ARDUINO_PYBSTICK26_STD)
    #define BLYNK_INFO_DEVICE  "STM32 PYBSTICK26_STD"
  #elif defined(ARDUINO_PYBSTICK26_PRO)
    #define BLYNK_INFO_DEVICE  "STM32 PYBSTICK26_PRO"        
  #else  
    #define BLYNK_INFO_DEVICE  "STM32F4"    
  #endif

  #define BLYNK_USE_128_VPINS
  #define BLYNK_BUFFERS_SIZE 1024
  #define BLYNK_NO_YIELD
  
#elif defined(STM32F7)

  #if defined(ARDUINO_NUCLEO_F767ZI)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F767ZI"
  #elif defined(ARDUINO_NUCLEO_F746ZG)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F746ZG"
  #elif defined(ARDUINO_NUCLEO_F756ZG)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F756ZG"
  #elif defined(ARDUINO_NUCLEO_F743ZI)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F743ZI"
  #elif defined(ARDUINO_NUCLEO_F743ZI2)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_F743ZI2"   
  #elif defined(ARDUINO_DISCO_F746NG)
    #define BLYNK_INFO_DEVICE  "STM32 DISCO_F746NG"  
  #elif defined(ARDUINO_REMRAM_V1)
    #define BLYNK_INFO_DEVICE  "STM32 REMRAM_V1"
  #else  
    #define BLYNK_INFO_DEVICE  "STM32F7"    
  #endif
  
  #define BLYNK_USE_128_VPINS
  #define BLYNK_BUFFERS_SIZE 4096
  #define BLYNK_NO_YIELD

#elif defined(STM32L0)

  #if defined(ARDUINO_NUCLEO_L053R8)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_L053R8"
  #elif defined(ARDUINO_NUCLEO_L073RZ)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_L073RZ"  
  #elif defined(ARDUINO_NUCLEO_L031K6)
    #define BLYNK_INFO_DEVICE  "STM32 NUCLEO_L031K6"  
  #elif defined(ARDUINO_DISCO_L072CZ_LRWAN1)
    #define BLYNK_INFO_DEVICE  "STM32 DISCO_L072CZ_LRWAN1"  
  #elif defined(ARDUINO_RHF76_052)
    #define BLYNK_INFO_DEVICE  "STM32 RHF76_052"  
  #elif defined(ARDUINO_THUNDERPACK_L072)
    #define BLYNK_INFO_DEVICE  "STM32 THUNDERPACK_L072"    
  #else  
    #define BLYNK_INFO_DEVICE  "STM32L0"
  #endif 
    
  #define BLYNK_USE_128_VPINS
  #define BLYNK_BUFFERS_SIZE 1024
  #define BLYNK_NO_YIELD
  
#elif defined(STM32L1)

    #define BLYNK_INFO_DEVICE  "STM32L1"
    
  #define BLYNK_USE_128_VPINS
  #define BLYNK_BUFFERS_SIZE 1024
  #define BLYNK_NO_YIELD
  
#elif defined(STM32L4)

